{"pageProps":{"projectName":"V-Sekai","currentAdr":{"slug":"2021-08-11-auto-start-k3s","package":null,"title":"Auto-installing iso image for k3s","status":"accepted","supersededBy":null,"tags":[],"deciders":[],"body":{"enhancedMdx":"\n### Context and Problem Statement\n\nNeed to reduce the cost of using k3s by self igniting k3s.\n\n### Describe the feature / enhancement and how it helps to overcome the problem or limitation\n\nGenerate an iso that can be used to self-ignite a working V-Sekai cluster system.\n\n### Describe how your proposal will work, with code, pseudo-code, mock-ups, and/or diagrams\n\n#### Plan\nAutomate this process into a iso.\n\n* Install the OS in the machine hard disk, reboot\n* Install the required RPM package for K3S to be installable, reboot\n* Install K3S\n\n#### Design for one node\n\n1. Wipe out system.\n1. run-k3s-prereq-installer: This service will run a script that installs the package necessary for K3S to be installed.\n1. run-k3s-installer: This service will run the K3S install script.\n\n#### Generate k3s iso image\n\n1. Fetch iso\n2. Replace ssh key \n3. Design a jsonnet for yaml.\n4. You need to take the contents of a ign file named k3s-autoinstall.ign, and place them inside the coreos-autoinstall.fcc file inline inside the storage.files array, in the object with path /home/core/k3s-autoinstall.ign.\n5. Create the coreos-autoinstall.ign file from the fcc file created on step 3.\n6. Embed the coreos-autoinstall.ign ignition file inside the ISO image.\n7. The iso name may vary.\n\n#### Github Actions\n\nCreate github actions to upload an artifact\n\n\n### If this enhancement will not be used often, can it be worked around with a few lines of script?\n\nK3s and operating systems are not a few lines of script.\n\n### Positive Consequences\n\n_No response_\n\n### Negative Consequences\n\n_No response_\n\n### Is there a reason why this should be core and done by us?\n\nNeed a system for testing.\n\n### References\n\n* https://www.murillodigital.com/tech_talk/k3s_in_coreos/\n\n### Derivative License\n\nCopyright (c) 2020-2021 V-Sekai contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"},"creationDate":"2021-08-11T08:33:08.000Z","lastEditDate":"2021-08-11T08:50:34.000Z","lastEditAuthor":"K. S. Ernest (iFire) Lee","publicationDate":null,"file":{"relativePath":"docs/decisions/2021-08-11-auto-start-k3s.md","absolutePath":"/home/runner/work/k3s-auto-start-gitops-image/k3s-auto-start-gitops-image/docs/decisions/2021-08-11-auto-start-k3s.md"},"repository":{"provider":"github","viewUrl":"https://github.com/V-Sekai/k3s-auto-start-gitops-image/blob/master/docs/decisions/2021-08-11-auto-start-k3s.md"}},"l4bVersion":"1.0.0-beta.11"},"__N_SSG":true}